```
Terraform will perform the following actions:

  # azurerm_storage_share.get_jenkins_io_website will be created
  + resource "azurerm_storage_share" "get_jenkins_io_website" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "website"
      + quota                = 50
      + resource_manager_id  = (known after apply)
      + storage_account_name = "getjenkinsio"
      + url                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```